Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: إلا من تولى وكفر
en: But if any turn away and reject Allah,-

source: فيعذبه الله العذاب الأكبر
en: Allah will punish him with a mighty Punishment,

source: إن إلينا إيابهم
en: For to Us will be their return;

source: ثم إن علينا حسابهم
en: Then it will be for Us to call them to account.

source: والفجر
en: By the break of Day

source: وليال عشر
en: By the Nights twice five;

source: والشفع والوتر
en: By the even and odd (contrasted);

source: والليل إذا يسر
en: And by the Night when it passeth away;-

source: هل في ذلك قسم لذي حجر
en: Is there (not) in these an adjuration (or evidence) for those who understand?

source: ألم تر كيف فعل ربك بعاد
en: Seest thou not how thy Lord dealt with the 'Ad (people),-

source: إرم ذات العماد
en: Of the (city of) Iram, with lofty pillars,

source: التي لم يخلق مثلها في البلاد
en: The like of which were not produced in (all) the land?

source: وثمود الذين جابوا الصخر بالواد
en: And with the Thamud (people), who cut out (huge) rocks in the valley?-

source: وفرعون ذي الأوتاد
en: And with Pharaoh, lord of stakes?

source: الذين طغوا في البلاد
en: (All) these transgressed beyond bounds in the lands,

source: فأكثروا فيها الفساد
en: And heaped therein mischief (on mischief).

source: فصب عليهم ربك سوط عذاب
en: Therefore did thy Lord pour on them a scourge of diverse chastisements:

source: إن ربك لبالمرصاد
en: For thy Lord is (as a Guardian) on a watch-tower.

source: فأما الإنسان إذا ما ابتلاه ربه فأكرمه ونعمه فيقول ربي أكرمن
en: Now, as for man, when his Lord trieth him, giving him honour and gifts, then saith he, (puffed up), "My Lord hath honoured me."

source: وأما إذا ما ابتلاه فقدر عليه رزقه فيقول ربي أهانن
en: But when He trieth him, restricting his subsistence for him, then saith he (in despair), "My Lord hath humiliated me!"

source: كلا بل لا تكرمون اليتيم
en: Nay, nay! but ye honour not the orphans!

source: ولا تحاضون على طعام المسكين
en: Nor do ye encourage one another to feed the poor!-

source: وتأكلون التراث أكلا لما
en: And ye devour inheritance - all with greed,

source: وتحبون المال حبا جما
en: And ye love wealth with inordinate love!

source: كلا إذا دكت الأرض دكا دكا
en: Nay! When the earth is pounded to powder,

source: وجاء ربك والملك صفا صفا
en: And thy Lord cometh, and His angels, rank upon rank,

source: وجيء يومئذ بجهنم يومئذ يتذكر الإنسان وأنى له الذكرى
en: And Hell, that Day, is brought (face to face),- on that Day will man remember, but how will that remembrance profit him?

source: يقول يا ليتني قدمت لحياتي
en: He will say: "Ah! Would that I had sent forth (good deeds) for (this) my (Future) Life!"

source: فيومئذ لا يعذب عذابه أحد
en: For, that Day, His Chastisement will be such as none (else) can inflict,

source: ولا يوثق وثاقه أحد
en: And His bonds will be such as none (other) can bind.

source: يا أيتها النفس المطمئنة
en: (To the righteous soul will be said:) "O (thou) soul, in (complete) rest and satisfaction!

source: ارجعي إلى ربك راضية مرضية
en: "Come back thou to thy Lord,- well pleased (thyself), and well-pleasing unto Him!

source: فادخلي في عبادي
en: "Enter thou, then, among My devotees!

source: وادخلي جنتي
en: "Yea, enter thou My Heaven!

source: لا أقسم بهذا البلد
en: I do call to witness this City;-

source: وأنت حل بهذا البلد
en: And thou art a freeman of this City;-

source: ووالد وما ولد
en: And (the mystic ties of) parent and child;-

source: لقد خلقنا الإنسان في كبد
en: Verily We have created man into toil and struggle.

source: أيحسب أن لن يقدر عليه أحد
en: Thinketh he, that none hath power over him?

source: يقول أهلكت مالا لبدا
en: He may say (boastfully); Wealth have I squandered in abundance!

source: أيحسب أن لم يره أحد
en: Thinketh he that none beholdeth him?

source: ألم نجعل له عينين
en: Have We not made for him a pair of eyes?-

source: ولسانا وشفتين
en: And a tongue, and a pair of lips?-

source: وهديناه النجدين
en: And shown him the two highways?

source: فلا اقتحم العقبة
en: But he hath made no haste on the path that is steep.

source: وما أدراك ما العقبة
en: And what will explain to thee the path that is steep?-

source: فك رقبة
en: (It is:) freeing the bondman;

source: أو إطعام في يوم ذي مسغبة
en: Or the giving of food in a day of privation

source: يتيما ذا مقربة
en: To the orphan with claims of relationship,

source: أو مسكينا ذا متربة
en: Or to the indigent (down) in the dust.

source: ثم كان من الذين آمنوا وتواصوا بالصبر وتواصوا بالمرحمة
en: Then will he be of those who believe, and enjoin patience, (constancy, and self-restraint), and enjoin deeds of kindness and compassion.

source: أولئك أصحاب الميمنة
en: Such are the Companions of the Right Hand.

source: والذين كفروا بآياتنا هم أصحاب المشأمة
en: But those who reject Our Signs, they are the (unhappy) Companions of the Left Hand.

source: عليهم نار مؤصدة
en: On them will be Fire vaulted over (all round).

source: والشمس وضحاها
en: By the Sun and his (glorious) splendour;

source: والقمر إذا تلاها
en: By the Moon as she follows him;

source: والنهار إذا جلاها
en: By the Day as it shows up (the Sun's) glory;

source: والليل إذا يغشاها
en: By the Night as it conceals it;

source: والسماء وما بناها
en: By the Firmament and its (wonderful) structure;

source: والأرض وما طحاها
en: By the Earth and its (wide) expanse:

source: ونفس وما سواها
en: By the Soul, and the proportion and order given to it;

source: فألهمها فجورها وتقواها
en: And its enlightenment as to its wrong and its right;-

source: قد أفلح من زكاها
en: Truly he succeeds that purifies it,

source: وقد خاب من دساها
en: And he fails that corrupts it!

source: كذبت ثمود بطغواها
en: The Thamud (people) rejected (their prophet) through their inordinate wrong-doing,

source: إذ انبعث أشقاها
en: Behold, the most wicked man among them was deputed (for impiety).

source: فقال لهم رسول الله ناقة الله وسقياها
en: But the Messenger of Allah said to them: "It is a She-camel of Allah! And (bar her not from) having her drink!"

source: فكذبوه فعقروها فدمدم عليهم ربهم بذنبهم فسواها
en: Then they rejected him (as a false prophet), and they hamstrung her. So their Lord, on account of their crime, obliterated their traces and made them equal (in destruction, high and low)!

source: ولا يخاف عقباها
en: And for Him is no fear of its consequences.

source: والليل إذا يغشى
en: By the Night as it conceals (the light);

source: والنهار إذا تجلى
en: By the Day as it appears in glory;

source: وما خلق الذكر والأنثى
en: By (the mystery of) the creation of male and female;-

source: إن سعيكم لشتى
en: Verily, (the ends) ye strive for are diverse.

source: فأما من أعطى واتقى
en: So he who gives (in charity) and fears (Allah),

source: وصدق بالحسنى
en: And (in all sincerity) testifies to the best,-

source: فسنيسره لليسرى
en: We will indeed make smooth for him the path to Bliss.

source: وأما من بخل واستغنى
en: But he who is a greedy miser and thinks himself self-sufficient,

source: وكذب بالحسنى
en: And gives the lie to the best,-

source: فسنيسره للعسرى
en: We will indeed make smooth for him the path to Misery;

source: وما يغني عنه ماله إذا تردى
en: Nor will his wealth profit him when he falls headlong (into the Pit).

source: إن علينا للهدى
en: Verily We take upon Ourselves to guide,

source: وإن لنا للآخرة والأولى
en: And verily unto Us (belong) the End and the Beginning.

source: فأنذرتكم نارا تلظى
en: Therefore do I warn you of a Fire blazing fiercely;

source: لا يصلاها إلا الأشقى
en: None shall reach it but those most unfortunate ones

source: الذي كذب وتولى
en: Who give the lie to Truth and turn their backs.

source: وسيجنبها الأتقى
en: But those most devoted to Allah shall be removed far from it,-

source: الذي يؤتي ماله يتزكى
en: Those who spend their wealth for increase in self-purification,

source: وما لأحد عنده من نعمة تجزى
en: And have in their minds no favour from anyone for which a reward is expected in return,

source: إلا ابتغاء وجه ربه الأعلى
en: But only the desire to seek for the Countenance of their Lord Most High;

source: ولسوف يرضى
en: And soon will they attain (complete) satisfaction.

source: والضحى
en: By the Glorious Morning Light,

source: والليل إذا سجى
en: And by the Night when it is still,-

source: ما ودعك ربك وما قلى
en: Thy Guardian-Lord hath not forsaken thee, nor is He displeased.

source: وللآخرة خير لك من الأولى
en: And verily the Hereafter will be better for thee than the present.

source: ولسوف يعطيك ربك فترضى
en: And soon will thy Guardian-Lord give thee (that wherewith) thou shalt be well-pleased.

source: ألم يجدك يتيما فآوى
en: Did He not find thee an orphan and give thee shelter (and care)?

source: ووجدك ضالا فهدى
en: And He found thee wandering, and He gave thee guidance.

source: ووجدك عائلا فأغنى
en: And He found thee in need, and made thee independent.

source: فأما اليتيم فلا تقهر
en: Therefore, treat not the orphan with harshness,

source: وأما السائل فلا تنهر
en: Nor repulse the petitioner (unheard);

source: وأما بنعمة ربك فحدث
en: But the bounty of the Lord - rehearse and proclaim!

source: ألم نشرح لك صدرك
en: Have We not expanded thee thy breast?-

source: ووضعنا عنك وزرك
en: And removed from thee thy burden

source: الذي أنقض ظهرك
en: The which did gall thy back?-

source: ورفعنا لك ذكرك
en: And raised high the esteem (in which) thou (art held)?

source: فإن مع العسر يسرا
en: So, verily, with every difficulty, there is relief:

source: إن مع العسر يسرا
en: Verily, with every difficulty there is relief.

source: فإذا فرغت فانصب
en: Therefore, when thou art free (from thine immediate task), still labour hard,

source: وإلى ربك فارغب
en: And to thy Lord turn (all) thy attention.

source: والتين والزيتون
en: By the Fig and the Olive,

source: وطور سينين
en: And the Mount of Sinai,

source: وهذا البلد الأمين
en: And this City of security,-

source: لقد خلقنا الإنسان في أحسن تقويم
en: We have indeed created man in the best of moulds,

source: ثم رددناه أسفل سافلين
en: Then do We abase him (to be) the lowest of the low,-

source: إلا الذين آمنوا وعملوا الصالحات فلهم أجر غير ممنون
en: Except such as believe and do righteous deeds: For they shall have a reward unfailing.

source: فما يكذبك بعد بالدين
en: Then what can, after this, contradict thee, as to the judgment (to come)?

source: أليس الله بأحكم الحاكمين
en: Is not Allah the wisest of judges?

source: اقرأ باسم ربك الذي خلق
en: Proclaim! (or read!) in the name of thy Lord and Cherisher, Who created-

source: خلق الإنسان من علق
en: Created man, out of a (mere) clot of congealed blood:

source: اقرأ وربك الأكرم
en: Proclaim! And thy Lord is Most Bountiful,-

source: الذي علم بالقلم
en: He Who taught (the use of) the pen,-

source: علم الإنسان ما لم يعلم
en: Taught man that which he knew not.

source: كلا إن الإنسان ليطغى
en: Nay, but man doth transgress all bounds,

source: أن رآه استغنى
en: In that he looketh upon himself as self-sufficient.

source: إن إلى ربك الرجعى
en: Verily, to thy Lord is the return (of all).

source: أرأيت الذي ينهى
en: Seest thou one who forbids-

source: عبدا إذا صلى
en: A votary when he (turns) to pray?

source: أرأيت إن كان على الهدى
en: Seest thou if he is on (the road of) Guidance?-

source: أو أمر بالتقوى
en: Or enjoins Righteousness?

source: أرأيت إن كذب وتولى
en: Seest thou if he denies (Truth) and turns away?

source: ألم يعلم بأن الله يرى
en: Knoweth he not that Allah doth see?

source: كلا لئن لم ينته لنسفعا بالناصية
en: Let him beware! If he desist not, We will drag him by the forelock,-

source: ناصية كاذبة خاطئة
en: A lying, sinful forelock!

source: فليدع ناديه
en: Then, let him call (for help) to his council (of comrades):

source: سندع الزبانية
en: We will call on the angels of punishment (to deal with him)!

source: كلا لا تطعه واسجد واقترب
en: Nay, heed him not: But bow down in adoration, and bring thyself the closer (to Allah)!

source: إنا أنزلناه في ليلة القدر
en: We have indeed revealed this (Message) in the Night of Power:

source: وما أدراك ما ليلة القدر
en: And what will explain to thee what the night of power is?

source: ليلة القدر خير من ألف شهر
en: The Night of Power is better than a thousand months.

source: تنزل الملائكة والروح فيها بإذن ربهم من كل أمر
en: Therein come down the angels and the Spirit by Allah's permission, on every errand:

source: سلام هي حتى مطلع الفجر
en: Peace!... This until the rise of morn!

source: لم يكن الذين كفروا من أهل الكتاب والمشركين منفكين حتى تأتيهم البينة
en: Those who reject (Truth), among the People of the Book and among the Polytheists, were not going to depart (from their ways) until there should come to them Clear Evidence,-

source: رسول من الله يتلو صحفا مطهرة
en: An messenger from Allah, rehearsing scriptures kept pure and holy:

source: فيها كتب قيمة
en: Wherein are laws (or decrees) right and straight.

source: وما تفرق الذين أوتوا الكتاب إلا من بعد ما جاءتهم البينة
en: Nor did the People of the Book make schisms, until after there came to them Clear Evidence.

source: وما أمروا إلا ليعبدوا الله مخلصين له الدين حنفاء ويقيموا الصلاة ويؤتوا الزكاة وذلك دين القيمة
en: And they have been commanded no more than this: To worship Allah, offering Him sincere devotion, being true (in faith); to establish regular prayer; and to practise regular charity; and that is the Religion Right and Straight.

source: إن الذين كفروا من أهل الكتاب والمشركين في نار جهنم خالدين فيها أولئك هم شر البرية
en: Those who reject (Truth), among the People of the Book and among the Polytheists, will be in Hell-Fire, to dwell therein (for aye). They are the worst of creatures.

source: إن الذين آمنوا وعملوا الصالحات أولئك هم خير البرية
en: Those who have faith and do righteous deeds,- they are the best of creatures.

source: جزاؤهم عند ربهم جنات عدن تجري من تحتها الأنهار خالدين فيها أبدا رضي الله عنهم ورضوا عنه ذلك لمن خشي ربه
en: Their reward is with Allah: Gardens of Eternity, beneath which rivers flow; they will dwell therein for ever; Allah well pleased with them, and they with Him: all this for such as fear their Lord and Cherisher.

source: إذا زلزلت الأرض زلزالها
en: When the earth is shaken to her (utmost) convulsion,

source: وأخرجت الأرض أثقالها
en: And the earth throws up her burdens (from within),

source: وقال الإنسان ما لها
en: And man cries (distressed): 'What is the matter with her?'-

source: يومئذ تحدث أخبارها
en: On that Day will she declare her tidings:

source: بأن ربك أوحى لها
en: For that thy Lord will have given her inspiration.

source: يومئذ يصدر الناس أشتاتا ليروا أعمالهم
en: On that Day will men proceed in companies sorted out, to be shown the deeds that they (had done).

source: فمن يعمل مثقال ذرة خيرا يره
en: Then shall anyone who has done an atom's weight of good, see it!

source: ومن يعمل مثقال ذرة شرا يره
en: And anyone who has done an atom's weight of evil, shall see it.

source: والعاديات ضبحا
en: By the (Steeds) that run, with panting (breath),

source: فالموريات قدحا
en: And strike sparks of fire,

source: فالمغيرات صبحا
en: And push home the charge in the morning,

source: فأثرن به نقعا
en: And raise the dust in clouds the while,

source: فوسطن به جمعا
en: And penetrate forthwith into the midst (of the foe) en masse;-

source: إن الإنسان لربه لكنود
en: Truly man is, to his Lord, ungrateful;

source: وإنه على ذلك لشهيد
en: And to that (fact) he bears witness (by his deeds);

source: وإنه لحب الخير لشديد
en: And violent is he in his love of wealth.

source: أفلا يعلم إذا بعثر ما في القبور
en: Does he not know,- when that which is in the graves is scattered abroad

source: وحصل ما في الصدور
en: And that which is (locked up) in (human) breasts is made manifest-

source: إن ربهم بهم يومئذ لخبير
en: That their Lord had been Well-acquainted with them, (even to) that Day?

source: القارعة
en: The (Day) of Noise and Clamour:

source: ما القارعة
en: What is the (Day) of Noise and Clamour?

source: وما أدراك ما القارعة
en: And what will explain to thee what the (Day) of Noise and Clamour is?

source: يوم يكون الناس كالفراش المبثوث
en: (It is) a Day whereon men will be like moths scattered about,

source: وتكون الجبال كالعهن المنفوش
en: And the mountains will be like carded wool.

source: فأما من ثقلت موازينه
en: Then, he whose balance (of good deeds) will be (found) heavy,

source: وأما من خفت موازينه
en: But he whose balance (of good deeds) will be (found) light,-

source: فأمه هاوية
en: Will have his home in a (bottomless) Pit.

source: وما أدراك ما هيه
en: And what will explain to thee what this is?

source: نار حامية
en: (It is) a Fire Blazing fiercely!

source: ألهاكم التكاثر
en: The mutual rivalry for piling up (the good things of this world) diverts you (from the more serious things),

source: حتى زرتم المقابر
en: Until ye visit the graves.

source: كلا سوف تعلمون
en: But nay, ye soon shall know (the reality).

source: ثم كلا سوف تعلمون
en: Again, ye soon shall know!

source: كلا لو تعلمون علم اليقين
en: Nay, were ye to know with certainty of mind, (ye would beware!)

source: لترون الجحيم
en: Ye shall certainly see Hell-Fire!

source: ثم لترونها عين اليقين
en: Again, ye shall see it with certainty of sight!

source: ثم لتسألن يومئذ عن النعيم
en: Then, shall ye be questioned that Day about the joy (ye indulged in!).

source: والعصر
en: By (the Token of) Time (through the ages),

source: إن الإنسان لفي خسر
en: Verily Man is in loss,

source: إلا الذين آمنوا وعملوا الصالحات وتواصوا بالحق وتواصوا بالصبر
en: Except such as have Faith, and do righteous deeds, and (join together) in the mutual teaching of Truth, and of Patience and Constancy.

source: ويل لكل همزة لمزة
en: Woe to every (kind of) scandal-monger and-backbiter,

source: الذي جمع مالا وعدده
en: Who pileth up wealth and layeth it by,

source: يحسب أن ماله أخلده
en: Thinking that his wealth would make him last for ever!

source: كلا لينبذن في الحطمة
en: By no means! He will be sure to be thrown into That which Breaks to Pieces,

source: وما أدراك ما الحطمة
en: And what will explain to thee That which Breaks to Pieces?

source: نار الله الموقدة
en: (It is) the Fire of (the Wrath of) Allah kindled (to a blaze),

source: التي تطلع على الأفئدة
en: The which doth mount (Right) to the Hearts:

source: إنها عليهم مؤصدة
en: It shall be made into a vault over them,

source: في عمد ممددة
en: In columns outstretched.

source: ألم تر كيف فعل ربك بأصحاب الفيل
en: Seest thou not how thy Lord dealt with the Companions of the Elephant?

source: ألم يجعل كيدهم في تضليل
en: Did He not make their treacherous plan go astray?

source: وأرسل عليهم طيرا أبابيل
en: And He sent against them Flights of Birds,

source: ترميهم بحجارة من سجيل
en: Striking them with stones of baked clay.

source: فجعلهم كعصف مأكول
en: Then did He make them like an empty field of stalks and straw, (of which the corn) has been eaten up.

source: لإيلاف قريش
en: For the covenants (of security and safeguard enjoyed) by the Quraish,

source: إيلافهم رحلة الشتاء والصيف
en: Their covenants (covering) journeys by winter and summer,-

source: فليعبدوا رب هذا البيت
en: Let them adore the Lord of this House,

source: الذي أطعمهم من جوع وآمنهم من خوف
en: Who provides them with food against hunger, and with security against fear (of danger).

source: أرأيت الذي يكذب بالدين
en: Seest thou one who denies the Judgment (to come)?

source: فذلك الذي يدع اليتيم
en: Then such is the (man) who repulses the orphan (with harshness),

source: فويل للمصلين
en: So woe to the worshippers

source: الذين هم عن صلاتهم ساهون
en: Who are neglectful of their prayers,

source: الذين هم يراءون
en: Those who (want but) to be seen (of men),

source: ويمنعون الماعون
en: But refuse (to supply) (even) neighbourly needs.

source: إنا أعطيناك الكوثر
en: To thee have We granted the Fount (of Abundance).

source: فصل لربك وانحر
en: Therefore to thy Lord turn in Prayer and Sacrifice.

source: إن شانئك هو الأبتر
en: For he who hateth thee, he will be cut off (from Future Hope).

source: قل يا أيها الكافرون
en: Say: O ye that reject Faith!

source: لا أعبد ما تعبدون
en: I worship not that which ye worship,

source: ولا أنتم عابدون ما أعبد
en: Nor will ye worship that which I worship.

source: ولا أنا عابد ما عبدتم
en: And I will not worship that which ye have been wont to worship,

source: لكم دينكم ولي دين
en: To you be your Way, and to me mine.

source: إذا جاء نصر الله والفتح
en: When comes the Help of Allah, and Victory,

source: ورأيت الناس يدخلون في دين الله أفواجا
en: And thou dost see the people enter Allah's Religion in crowds,

source: فسبح بحمد ربك واستغفره إنه كان توابا
en: Celebrate the praises of thy Lord, and pray for His Forgiveness: For He is Oft-Returning (in Grace and Mercy).

source: تبت يدا أبي لهب وتب
en: Perish the hands of the Father of Flame! Perish he!

source: ما أغنى عنه ماله وما كسب
en: No profit to him from all his wealth, and all his gains!

source: سيصلى نارا ذات لهب
en: Burnt soon will he be in a Fire of Blazing Flame!

source: وامرأته حمالة الحطب
en: His wife shall carry the (crackling) wood - As fuel!-

source: في جيدها حبل من مسد
en: A twisted rope of palm-leaf fibre round her (own) neck!

source: قل هو الله أحد
en: Say: He is Allah, the One and Only;

source: الله الصمد
en: Allah, the Eternal, Absolute;

source: لم يلد ولم يولد
en: He begetteth not, nor is He begotten;

source: ولم يكن له كفوا أحد
en: And there is none like unto Him.

source: قل أعوذ برب الفلق
en: Say: I seek refuge with the Lord of the Dawn

source: من شر ما خلق
en: From the mischief of created things;

source: ومن شر غاسق إذا وقب
en: From the mischief of Darkness as it overspreads;

source: ومن شر النفاثات في العقد
en: From the mischief of those who practise secret arts;

source: ومن شر حاسد إذا حسد
en: And from the mischief of the envious one as he practises envy.

source: قل أعوذ برب الناس
en: Say: I seek refuge with the Lord and Cherisher of Mankind,

source: ملك الناس
en: The King (or Ruler) of Mankind,

source: إله الناس
en: The god (or judge) of Mankind,-

source: من شر الوسواس الخناس
en: From the mischief of the Whisperer (of Evil), who withdraws (after his whisper),-

source: الذي يوسوس في صدور الناس
en: (The same) who whispers into the hearts of Mankind,-

source: من الجنة والناس
en: Among Jinns and among men.
